connector/src/test/resources/com/github/veithen/visualwas/connector/federation/queryNames-java-lang-request.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Header xmlns:ns0="admin" ns0:JMXMessageVersion="1.2.0" ns0:JMXVersion="1.2.0">
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<ns1:queryNames xmlns:ns1="urn:AdminService" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<objectname xsi:type="ns1:javax.management.ObjectName">rO0ABXNyABtqYXZheC5tYW5hZ2VtZW50Lk9iamVjdE5hbWUPA6cb620VzwMAAHhwdAALamF2YS5sYW5nOip4</objectname>
<queryexp xmlns:ns2="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:javax.management.QueryExp" xsi:nil="true"/>
</ns1:queryNames>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
